#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.subdomain: Refreshing state... [id=www.aheadinthecloud.com]
data.aws_route53_zone.selected: Reading...
data.aws_caller_identity.current: Reading...
aws_s3_bucket.logs: Refreshing state... [id=logs.aheadinthecloud.com]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud.com]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
data.aws_route53_zone.selected: Read complete after 0s [id=Z08846413OJRCH3MJOFHV]
aws_s3_bucket_public_access_block.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_policy.public_read_get_object: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_website_configuration.domain: Refreshing state... [id=aheadinthecloud.com]
aws_s3_bucket_website_configuration.subdomain: Refreshing state... [id=www.aheadinthecloud.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.domain will be created
  + resource "aws_route53_record" "domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aheadinthecloud.com"
      + type            = "A"
      + zone_id         = "Z08846413OJRCH3MJOFHV"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-us-east-1.amazonaws.com"
          + zone_id                = "Z3AQBSTGFYJSTF"
        }
    }

  # aws_route53_record.subdomain will be created
  + resource "aws_route53_record" "subdomain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.aheadinthecloud.com"
      + type            = "A"
      + zone_id         = "Z08846413OJRCH3MJOFHV"

      + alias {
          + evaluate_target_health = false
          + name                   = "s3-website-us-east-1.amazonaws.com"
          + zone_id                = "Z3AQBSTGFYJSTF"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*